
## Active Directory Federation Services


## ---------------------------------------------------------------------------
## General - AD FS
## First we rename the long source definition which comes by default
[source::...WinEventLog:AD FS/Admin]
# Default shorten to easy readable source
EVAL-source = "XmlWinEventLog:ADFS"

## ---------------------------------------------------------------------------
## CIM - Authentication
## describe login activities from any data source.

# [X] action - The action performed on the resource. Prescribed fields: success, failure, pending, error.
# [] app - The application involved in the event (such as ssh, splunk, win:local, signin.amazonaws.com).
# [X] authentication_method - The method used to authenticate the request such as SAML, FIDO, MFA, Kerberos, NTLM, LM, NTLMv2, PSK, Password.
# [X] authentication_service - The service used to authenticate the request such as Okta, ActiveDirectory, AzureAD.
# [X] dest - The target involved in the authentication.
# [] dest_bunit - The business unit of the authentication target.
# [] dest_category - The category of the authentication target, such as email_server or SOX-compliant.
# [] dest_nt_domain - The name of the Active Directory used by the authentication target, if applicable.
# [] dest_priority - The priority of the authentication target.
# [] duration - The amount of time for the completion of the authentication event, in seconds.
# [X] reason - The human-readable message associated with the authentication action (success or failure).
# [] response_time - The amount of time it took to receive a response in the authentication event, in seconds.
# [X] signature - A human-readable signature name.
# [X] signature_id - The unique identifier or event code of the event signature.
# [] src - The source involved in the authentication. In the case of endpoint protection authentication the src is the client. You can alias this from more specific fields, such as src_host, src_ip, or src_nt_host.
# [] src_bunit - The business unit of the authentication source.
# [] src_category - The category of the authentication source, such as email_server or SOX-compliant.
# [] src_nt_domain - The name of the Active Directory used by the authentication source, if applicable.
# [] src_priority - The priority of the authentication source.
# [] src_user - In privilege escalation events, src_user represents the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
# [] src_user_bunit - The business unit of the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
# [] src_user_category - The category of the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
# [] src_user_id - The unique id of the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
# [] src_user_priority - The priority of the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
# [] src_user_role - The role of the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
# [] src_user_type - The type of the user who initiated the privilege escalation. This field is unnecessary when an escalation has not been performed.
# [] tag - This automatically-generated field is used to access tags from within data models. Do not define extractions for this field when writing add-ons.
# [X] user - The actual string or identifier that a user is logging in with. This is the user involved in the event, or who initiated the event.
# [] user_agent - The user agent through which the request was made, such as Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_6) or aws-cli/2.0.0 Python/3.7.4 Darwin/18.7.0 botocore/2.0.0dev4.
# [] user_bunit - The business unit of the user involved in the event, or who initiated the event. For authentication privilege escalation events this should represent the user targeted by the escalation.
# [] user_category - The category of the user involved in the event, or who initiated the event. For authentication privilege escalation events, this should represent the user targeted by the escalation.
# [] user_id - The unique id of the user involved in the event. For authentication privilege escalation events, this should represent the user targeted by the escalation.
# [] user_priority - The priority of the user involved in the event, or who initiated the event. For authentication privilege escalation events, this should represent the user targeted by the escalation.
# [] user_role - The role of the user involved in the event, or who initiated the event. For authentication privilege escalation events, this should represent the user role targeted by the escalation.
# [X] user_type - The type of the user involved in the event or who initiated the event, such as IAMUser, Admin, or System. For authentication privilege escalation events, this should represent the user type targeted by the escalation.
# [] vendor_account - The account that manages the user that initiated the request.

EVAL-authentication_method = if(like(_raw, "%<Data>wsfed</Data>%"), "WS-Federation", None)
EVAL-authentication_service = "ActiveDirectory Federation Services"
REPORT-user = user
REPORT-user_name = user_name
REPORT-user_email = user_email
REPORT-reason = reason
EVAL-user_type = if(like(user, "a-%"), "Admin", None)
REPORT-reason_simple = reason_simple
LOOKUP-action = adfs_action_lookup reason AS reason_simple OUTPUT action AS action
LOOKUP-signature = adfs_signatures_lookup id as signature_id OUTPUT signature_name, signature

[source::XmlWinEventLog:Security]
LOOKUP-signature_security_events = adfs_windows_events_lookup id AS signature_id OUTPUT signature_name, signature
EXTRACT-ActivityID = (?:\<EventData\>\<Data\>)(?<ActivityID>[\w\-]+)\<\/Data\>
